In [4]:
şagirdlər = {
    'Ad': ['Kamil', 'Şəhla', 'Arzu'],
    'Soyad': ['Orucov', 'Qasımova', 'Teymurova'],
    'Qiymət': [87, 93, 75]
}

In [5]:
import pandas as pd

df = pd.DataFrame(şagirdlər)
df

      Ad      Soyad  Qiymət
0  Kamil     Orucov      87
1  Şəhla   Qasımova      93
2   Arzu  Teymurova      75

In [6]:
df['Soyad']

0       Orucov
1     Qasımova
2    Teymurova
Name: Soyad, dtype: object

In [7]:
type(df['Soyad'])

pandas.core.series.Series

In [8]:
df.columns

Index(['Ad', 'Soyad', 'Qiymət'], dtype='object')

In [9]:
df.columns[0]

'Ad'

In [10]:
df[['Ad', 'Soyad']]

      Ad      Soyad
0  Kamil     Orucov
1  Şəhla   Qasımova
2   Arzu  Teymurova

In [11]:
df.iloc[1]

Ad           Şəhla
Soyad     Qasımova
Qiymət          93
Name: 1, dtype: object

In [12]:
df.iloc[[0, 2]]

      Ad      Soyad  Qiymət
0  Kamil     Orucov      87
2   Arzu  Teymurova      75

In [13]:
df.iloc[[0, 2], 1]

0       Orucov
2    Teymurova
Name: Soyad, dtype: object

In [14]:
df.iloc[[0, 2], [0, 2]]

      Ad  Qiymət
0  Kamil      87
2   Arzu      75

In [15]:
turbo_df = pd.read_csv('turbo.csv')
turbo_df

          Price  Year Engine    Distance
0    12 700 AZN  2008  1.5 L  384 633 km
1    19 000 AZN  2010  1.8 L  316 656 km
2    13 900 AZN  2008  1.5 L  175 000 km
3    12 800 AZN  2007  1.5 L  210 000 km
4    14 500 AZN  2006  1.5 L  137 000 km
..          ...   ...    ...         ...
987  19 000 AZN  2012  1.8 L  167 000 km
988  10 000 AZN  2007  1.5 L  187 000 km
989  20 000 AZN  2007  1.5 L  150 000 km
990  13 900 AZN  2008  1.5 L  175 000 km
991  12 200 AZN  2008  1.5 L  150 000 km

[992 rows x 4 columns]

In [17]:
turbo_df.iloc[250:370, 0:2]

          Price  Year
250  17 600 AZN  2011
251  13 750 AZN  2007
252  22 300 AZN  2013
253  19 400 AZN  2014
254  10 000 AZN  2008
..          ...   ...
365  17 400 AZN  2012
366  16 900 AZN  2009
367  12 900 AZN  2006
368  17 500 AZN  2012
369  13 200 AZN  2008

[120 rows x 2 columns]

In [18]:
turbo_df.loc[125]

Price       13 500 AZN
Year              2006
Engine           1.5 L
Distance    132 930 km
Name: 125, dtype: object

In [20]:
turbo_df.loc[110:245, 'Price':'Engine']

          Price  Year Engine
110  12 900 AZN  2007  1.5 L
111  12 950 AZN  2005  1.5 L
112  12 950 AZN  2008  1.5 L
113  15 900 AZN  2010  1.8 L
114  17 300 AZN  2010  1.8 L
..          ...   ...    ...
241  13 700 AZN  2007  1.5 L
242  11 900 AZN  2008  1.5 L
243  20 900 AZN  2012  1.8 L
244  13 500 AZN  2007  1.5 L
245  12 900 AZN  2007  1.5 L

[136 rows x 3 columns]